linux/filesystem.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>filesystem.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/linux">Up: linux</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/linux/iptables.org.html">Next: iptables.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="概述">概述</h1>
<p>文件系统在平的存储结构上构建出文件、目录等层次结构，并提供了其它保护、完整性校验的功能</p>
<h1 id="参考资料">参考资料</h1>
<ul class="incremental">
<li><code>man 5 filesystem</code></li>
<li><code>/proc/filesystem</code> 列出系统支持的文件系统</li>
<li><code>lsblk</code></li>
<li><code>findmnt</code></li>
<li><code>tune2fs</code></li>
<li><code>dumpe2fs</code></li>
</ul>
<h1 id="特性">特性</h1>
<h2 id="日志">日志</h2>
<p>类似于 hbase WAL 机制，可针对元数据和数据</p>
<ul class="incremental">
<li>data-model 针对数据和元数据</li>
<li>ordered-model 针对元数据</li>
<li>Reiser4: transcation model 机制</li>
<li>ZFS/Btrfs: copy-on-write 机制</li>
</ul>
<h2 id="fuse">FUSE</h2>
<p>Filesystem in Userspace，允许用户层实现的文件系统。透过 fuse 内核模块来伪装成一个文件系统，如 fuseiso, xmlfs</p>
<h2 id="stackable-filesystem">Stackable Filesystem</h2>
<p>unionfs，在 docker 中常用</p>
<h2 id="readonly-filesystem">Readonly Filesystem</h2>
<p>SquashFS（ubuntu livecd?）</p>
<h1 id="inode">inode</h1>
<p>每个文件、目录、链接都占用一个 inode 位置，有可能大量小文件时，inode 使用殆尽，而空间还有剩余。使用 <code>df -h</code> 查看文件系统空间占用，使用 <code>df -i</code> 查看 inode 占用</p>
<p>通过 <code>inode-per-bytes</code> 来指定比例。不小于 blocksize</p>
<ul class="incremental">
<li>存储少量大文件，可以设为 4M 或者更大</li>
<li>存储大量小文件，可以设为 4k 或者最小 1k（因为 blocksize 为 1k）</li>
</ul>

      </div>
    </section>
  </body>
</html>
